---
kind: type
id: T:Autodesk.Revit.DB.InsertOrientation
source: html/56071e06-8677-f30a-f026-425dc1d98dd2.htm
---
# Autodesk.Revit.DB.InsertOrientation

The allowed values for the INSERT_ORIENTATION parameter.

## Syntax (C#)
```csharp
public enum InsertOrientation
```